"""
## პრობლემა 9: არა-მთავარი რიცხვების იდენტიფიცირება დიაპაზონში

**მიზანი:**


შექმენით ფუნქცია, რომელიც იღებს ორ მთელ რიცხვს, დასაწყისს და 
დასასრულს, და 

აბრუნებს ყველა არა-მთავარი რიცხვის სიას დიაპაზონში [დასაწყისი, დასასრული] 


(ჩათვლით). არა-მთავარი რიცხვი განისაზღვრება როგორც ნებისმიერი მთელი რიცხვი 

1-ზე მეტი, რომელიც არ არის მთავარი რიცხვი. 
"""

def numbers(start,stop):
    for i in range(start,stop):
        return start
print(numbers([10,20 ,]))

#Input: start = 10, end = 20
#Output: [10, 12, 14, 15, 16, 18, 20]
#Input: start = 1, end = 10
# Output: [1, 4, 6, 8, 9, 10]

# Input: start = 20, end = 30
#  Output: [20, 21, 22, 24, 25, 26, 27, 28, 30]
# Input: start = 24, end = 25
#  Output: [24, 25]
# Input: start = 1, end = 1
#  Output: [1]

